// import { addCommerce } from 'redux/Comercial/operationsCommercial';
import AddForm from '../components/AddForm';
// import { useDispatch } from 'react-redux';

const Add = () => {
  // const dispatch = useDispatch();
  // const handleAddToDatabase = () => {
  //   const lvivObjects = [
  //     {
  //       name: 'Ресторан "Смак України"',
  //       area: 80,
  //       address: 'вул. Шевченка, 10, Київ',
  //       price: 400,
  //       location: { lat: 50.4501, lng: 30.5234 },
  //     },
  //     {
  //       name: 'Музей "Слава Україні"',
  //       area: 150,
  //       address: 'вул. Івана Франка, 25, Львів',
  //       price: 600,
  //       location: { lat: 49.8415, lng: 24.0305 },
  //     },
  //     {
  //       name: 'Готель "Карпатський Рай"',
  //       area: 120,
  //       address: 'вул. Григоренка, 7, Івано-Франківськ',
  //       price: 500,
  //       location: { lat: 48.9226, lng: 24.7111 },
  //     },
  //     {
  //       name: 'Театр "Зоряний Берег"',
  //       area: 200,
  //       address: 'вул. Пушкінська, 30, Одеса',
  //       price: 800,
  //       location: { lat: 46.4694, lng: 30.7408 },
  //     },
  //     {
  //       name: 'Кафе "Сонячна Долина"',
  //       area: 60,
  //       address: 'вул. Лесі Українки, 14, Харків',
  //       price: 300,
  //       location: { lat: 49.9935, lng: 36.2304 },
  //     },
  //     {
  //       name: 'Ботанічний Сад "Київська Роза"',
  //       area: 300,
  //       address: 'вул. Тимошенка, 19, Київ',
  //       price: 1200,
  //       location: { lat: 50.4312, lng: 30.4776 },
  //     },
  //     {
  //       name: 'Магазин "Українська Вишиванка"',
  //       area: 40,
  //       address: 'вул. Івана Мазепи, 5, Луцьк',
  //       price: 200,
  //       location: { lat: 50.7469, lng: 25.3214 },
  //     },
  //     {
  //       name: 'Пляж "Чорне Море"',
  //       area: 500,
  //       address: 'вул. Франка, 55, Одеса',
  //       price: 2000,
  //       location: { lat: 46.4733, lng: 30.7272 },
  //     },
  //     {
  //       name: 'Кінотеатр "Дніпровська Перлина"',
  //       area: 180,
  //       address: 'вул. Кірова, 18, Дніпро',
  //       price: 700,
  //       location: { lat: 48.4634, lng: 35.0465 },
  //     },
  //     {
  //       name: 'Арт-галерея "Українське Мистецтво"',
  //       area: 100,
  //       address: 'вул. Героїв Майдану, 8, Луганськ',
  //       price: 450,
  //       location: { lat: 48.574, lng: 39.3069 },
  //     },
  //     {
  //       name: 'Стадіон "Карпатська Гора"',
  //       area: 250,
  //       address: 'вул. Спортивна, 40, Ужгород',
  //       price: 1000,
  //       location: { lat: 48.6208, lng: 22.2879 },
  //     },
  //     {
  //       name: 'Парк "Зелений Ліс"',
  //       area: 400,
  //       address: 'вул. Паркова, 2, Житомир',
  //       price: 1500,
  //       location: { lat: 50.2649, lng: 28.6584 },
  //     },
  //     {
  //       name: 'Історичний Музей "Стародавня Україна"',
  //       area: 200,
  //       address: 'вул. Культури, 12, Херсон',
  //       price: 800,
  //       location: { lat: 46.6322, lng: 32.6169 },
  //     },
  //     {
  //       name: 'Сквер "Майдан Незалежності"',
  //       area: 150,
  //       address: 'пл. Незалежності, 1, Кропивницький',
  //       price: 600,
  //       location: { lat: 48.5079, lng: 32.2629 },
  //     },
  //     {
  //       name: `'Кав'ярня "Карпатська Ідилія"'`,
  //       area: 80,
  //       address: 'вул. Шевченка, 22, Івано-Франківськ',
  //       price: 400,
  //       location: { lat: 48.9215, lng: 24.7118 },
  //     },
  //     {
  //       name: 'Льодова Арена "Львівські Крила"',
  //       area: 300,
  //       address: 'вул. Стрийська, 82, Львів',
  //       price: 1200,
  //       location: { lat: 49.8287, lng: 24.0115 },
  //     },
  //     {
  //       name: 'Концертний Зал "Аккорд"',
  //       area: 100,
  //       address: 'вул. Шевченка, 15, Чернівці',
  //       price: 450,
  //       location: { lat: 48.2918, lng: 25.9399 },
  //     },
  //     {
  //       name: 'Готель "Горгани"',
  //       area: 180,
  //       address: 'вул. Космонавтів, 7, Івано-Франківськ',
  //       price: 700,
  //       location: { lat: 48.9358, lng: 24.7371 },
  //     },
  //     {
  //       name: 'Театр "Арена"',
  //       area: 120,
  //       address: 'вул. Культури, 18, Житомир',
  //       price: 500,
  //       location: { lat: 50.2614, lng: 28.6601 },
  //     },
  //     {
  //       name: 'Меморіальний Комплекс "Бабин Яр"',
  //       area: 250,
  //       address: 'вул. Академіка Павлова, 13, Київ',
  //       price: 1000,
  //       location: { lat: 50.4546, lng: 30.4336 },
  //     },
  //     {
  //       name: 'Парк "Софіївка"',
  //       area: 400,
  //       address: 'вул. Паркова, 1, Умань',
  //       price: 1500,
  //       location: { lat: 48.7535, lng: 30.2186 },
  //     },
  //     {
  //       name: 'Музичний Фонтан "Райдуга"',
  //       area: 200,
  //       address: 'вул. Корзо, 5, Луцьк',
  //       price: 800,
  //       location: { lat: 50.7472, lng: 25.3281 },
  //     },
  //     {
  //       name: 'Пляж "Азовське Море"',
  //       area: 500,
  //       address: 'вул. Приморська, 40, Маріуполь',
  //       price: 2000,
  //       location: { lat: 47.0957, lng: 37.5419 },
  //     },
  //     {
  //       name: 'Кінотеатр "Мир"',
  //       area: 60,
  //       address: 'вул. Садова, 7, Суми',
  //       price: 300,
  //       location: { lat: 50.9228, lng: 34.8038 },
  //     },
  //     {
  //       name: 'Ботанічний Сад "Різнобарв\'я"',
  //       area: 300,
  //       address: 'вул. Героїв Майдану, 4, Донецьк',
  //       price: 1200,
  //       location: { lat: 48.0159, lng: 37.8029 },
  //     },
  //     {
  //       name: 'Магазин "Сучасна Вишиванка"',
  //       area: 40,
  //       address: 'вул. Івана Мазепи, 8, Чернігів',
  //       price: 200,
  //       location: { lat: 51.4942, lng: 31.2875 },
  //     },
  //     {
  //       name: 'Парк "Гірська Діброва"',
  //       area: 150,
  //       address: 'вул. Лісова, 10, Яремче',
  //       price: 600,
  //       location: { lat: 48.4443, lng: 24.5489 },
  //     },
  //     {
  //       name: 'Історичний Музей "Старовинна Україна"',
  //       area: 100,
  //       address: 'вул. Шевченка, 14, Кременчук',
  //       price: 450,
  //       location: { lat: 49.0661, lng: 33.4137 },
  //     },
  //     {
  //       name: 'Сквер "Молодіжний"',
  //       area: 150,
  //       address: 'вул. Шевченка, 20, Чернівці',
  //       price: 600,
  //       location: { lat: 48.2904, lng: 25.9401 },
  //     },
  //     {
  //       name: `'Кав'ярня "Кавовий Аромат"'`,
  //       area: 80,
  //       address: 'вул. Грушевського, 5, Львів',
  //       price: 400,
  //       location: { lat: 49.8397, lng: 24.0294 },
  //     },
  //     {
  //       name: 'Льодова Арена "Подільський Лід"',
  //       area: 300,
  //       address: 'вул. Івана Франка, 11, Вінниця',
  //       price: 1200,
  //       location: { lat: 49.2331, lng: 28.4771 },
  //     },
  //     {
  //       name: 'Концертний Зал "Гармонія"',
  //       area: 100,
  //       address: 'вул. Шевченка, 30, Полтава',
  //       price: 450,
  //       location: { lat: 49.5883, lng: 34.5512 },
  //     },
  //     {
  //       name: 'Готель "Сонячний Промінь"',
  //       area: 180,
  //       address: 'вул. Садова, 14, Суми',
  //       price: 700,
  //       location: { lat: 50.9077, lng: 34.8055 },
  //     },
  //     {
  //       name: 'Театр "Мистецтво"',
  //       area: 120,
  //       address: 'вул. Культури, 22, Кропивницький',
  //       price: 500,
  //       location: { lat: 48.5085, lng: 32.2653 },
  //     },
  //     {
  //       name: 'Меморіальний Комплекс "Холодний Яр"',
  //       area: 250,
  //       address: 'вул. Академіка Павлова, 20, Харків',
  //       price: 1000,
  //       location: { lat: 50.0, lng: 36.25 },
  //     },
  //     {
  //       name: 'Парк "Південна Роса"',
  //       area: 400,
  //       address: 'вул. Паркова, 5, Одеса',
  //       price: 1500,
  //       location: { lat: 46.4694, lng: 30.7408 },
  //     },
  //   ];
  //   lvivObjects.forEach(item => dispatch(addCommerce(item)));
  // };

  return (
    <>
      <>
        <AddForm />
        {/* <button style={{ position: 'absolute' }} onClick={handleAddToDatabase}>
          Додати до бази даних
        </button> */}
      </>
    </>
  );
};
export default Add;
